src/cf/Enums/уатФормыОплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатФормыОплаты</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежнаяКарта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Агрегатор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/уатФормыОплаты/Ext/ManagerModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить(Перечисления.уатФормыОплаты.Наличные);
	ДанныеВыбора.Добавить(Перечисления.уатФормыОплаты.Безналичные);
	ДанныеВыбора.Добавить(Перечисления.уатФормыОплаты.ПлатежнаяКарта);
	Если уатОбщегоНазначенияПовтИсп.ВариантПоставкиТакси() 
		И Константы.такИспользоватьЗаказыТакси.Получить() = Истина Тогда
		ДанныеВыбора.Добавить(Перечисления.уатФормыОплаты.Агрегатор);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
